// Cоздать функцию которая принимает число и возвращает  текст как в примере:
//     3275  —>  "3000 + 200 + 70 +5"
//
// function divider(number) {
//     let splited = number + ''.split('');
//     let str = '';
//     for (let i = 0; i < splited.length - 1; i++) {
//         str += `${splited[i] * (10 ** (+splited.length - (i + 1)))} + `;
//     }
//     str += splited[splited.length - 1];
//     console.log(str)
// }
//
// divider(3275);

// ____________________________________________________________
//
// Дан массив целых чисел, найдите тот, который встречается нечетное количество раз.Всегда будет только одно целое число, которое встречается нечетное количество раз
//     [1,2,3,4,5,2,4,1,3] -> 5

// let numbers = [1, 2, 3, 4, 5, 2, 4, 1, 3];
//
// console.log(numbers.find(number => numbers.filter(item => number === item).length % 2 !== 0));

// _____________________________________________________________
//
// Знайти анаграму.
//     Перевірити чи слово має в собі такі самі літери як і поеперднє слово.
//
//     ANAGRAM | MGANRAA -> true
// EXIT | AXET -> false
// GOOD | DOGO -> true

function sortWord(word) {
    return word.split('').sort().join('');
}

function $(firstWord, secondWord) {
    console.log(sortWord(firstWord) === sortWord(secondWord))
}

$('ANAGRAM', 'MGANRAA');
$('EXIT', 'AXET');
$('GOOD', 'DOGO');


// _______________________________________________________________
//
// Точная степень двойки
// Дано натуральное число N.
//     Выведите слово YES, если число N является точной степенью двойки, или слово NO в противном случае.
//     Операцией возведения в степень пользоваться нельзя!


// let N = 8;
// console.log((N).toString(2).replace(/0/g, '') == 1);


//     ______________________________________________________________
//
// Сумма цифр числа
// Дано натуральное число N. Вычислите сумму его цифр.
//     При решении этой задачи нельзя использовать строки,
//     списки, массивы ну и циклы, разумеется.
//     Рекурсія)

// let number=999;
// function sumnumbers(number){
//     let res=number%10;
//     number=number/10^0;
//         if(number!==0){
//             res+=sumnumbers(number);
//         }
//         return res;
// }
//
// console.log(sumnumbers(number))

// ______________________________________________________________
//
// Палиндром
// Дано слово, состоящее только из строчных латинских букв. Проверьте, является ли это слово палиндромом. Выведите YES или NO.
//     При решении этой задачи нельзя пользоваться циклами, в решениях на питоне нельзя использовать срезы с шагом, отличным от 1.

//
// let word='Anna';
//
// function palindrom(word){
//     if(word.toLowerCase()===word.split('').reverse().join('').toLowerCase()) console.log('Yes');
//     else console.log('No');
// }
//
// palindrom(word);


// _______________________________________________________________
//
// Количество единиц
// Дана последовательность натуральных чисел  в строке, завершающаяся двумя числами 0 подряд. Определите, сколько раз в этой
// последовательности встречается число 1. Числа, идущие после двух нулей, необходимо игнорировать.
//
// 2176491947586100 -> 3

// let number=2176491947586100111111111111;
//
// function count(num){
//     num+='';
//     let splited=num.split('');
//     let cal=0;
//     for (let i = 0; i < splited.length; i++) {
//         if(splited[i]==='1'){
//             cal++;
//         }
//         else if(splited[i]==='0'&&splited[i+1]==='0'){
//             break;
//         }
//     }
//     console.log(cal);
// }
//
// count(number);

// _________________________________________________________________
//
// Вирівняти багаторівневий масив в однорівневий
//     [1,3, ['Hello, 'Wordd', [9,6,1]], ['oops'], 9] -> [1, 3, 'Hello, 'Wordd', 9, 6, 1, 'oops', 9]
// flat використовувати заборонено.

// let oneArr=[1,3, ['Hello', 'Wordd', [9,6,1, [9,6,1, [9,6,1, [9,6,1, [9,6,1, [9,6,1, [9,6,1, [9,6,1, [9,6,1, [9,6,1, [9,6,1, [9,6,1, [9,6,1, [9,6,1, [9,6,1, [9,6,1, [9,6,1]]]]]]]]]]]]]]]], [9,6,1], [9,6,1], [9,6,1], [9,6,1], [9,6,1], [9,6,1], [9,6,1], [9,6,1], [9,6,1], [9,6,1], [9,6,1], [9,6,1], [9,6,1], [9,6,1]]], ['oops'], 9];
//
// function  myFlat(oldArr,newArr=[]){
//     for (let i = 0; i < oldArr.length; i++) {
//         if(typeof oldArr[i]==="object"){
//             myFlat(oldArr[i],newArr);
//         }else{
//             newArr.push(oldArr[i]);
//         }
//     }
//     return newArr
// }
//
// console.log(myFlat(oneArr));
// console.log(oneArr.flat(18))

//     ___________________________________________________________________
//
// Знайти набільший елемент в масиві за допомогою reduce
//     [1,6,9,0,17,88,4,7] -> 88

// let numbers=[1,6,9,0,17,88,4,7];
// console.log(numbers.reduce((prev, next) => prev > next ? prev : next));

// // __________________________________________________________________
//
// Знайти найблільше число поліндром яке утворюється завдяки добутку двох простих пятизначних чисел.
//
//     ____________________________________________________________________